Table of Contents
 Class BimLinkScope
Namespace
IdeaStatiCa.BimApiLink.Scoping
Assembly
IdeaStatiCa.BimApiLink.dll
public class BimLinkScope : IScope, IDisposable
Inheritance
object
BimLinkScope
Implements
IScope
IDisposable
Inherited Members
 object.ToString()
 object.Equals(object)
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
Constructors
 BimLinkScope(IBimApiImporter, IScopeHook, CountryCode, object)
public BimLinkScope(IBimApiImporter bimApiImporter, IScopeHook scopeHook, CountryCode countryCode, object userData)
Parameters
bimApiImporter IBimApiImporter
scopeHook IScopeHook
countryCode CountryCode
userData object
Properties
 BimApiImporter
public IBimApiImporter BimApiImporter { get; }
Property Value
IBimApiImporter
 CountryCode
public CountryCode CountryCode { get; }
Property Value
CountryCode
 UserData
public object UserData { get; }
Property Value
object
Methods
 Dispose()
Performs application-defined tasks associated with freeing, releasing, or resetting unmanaged resources.
public void Dispose()
 Edit this page